t21/Walnut_X/Packages/.cache/Keil.STM32F4xx_DFP.2.9.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32F4xx_DFP</name>
  <description>STMicroelectronics STM32F4 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="2.9.0" date="2016-05-31">
      Added device support for subfamily STM32F412
      - updated device list according STM32Cube V1.45.0
      Updated Pack to STM32Cube_FW_F4 Firmware Package version V1.12.0
      Updated HAL to version V1.5.0
      Updated CMSIS drivers:
      - CAN:
      -- reflect changes from RTE_Device.h (Ver 2.4.1) adding pin configurations
      -- corrected CAN2 initialization was disabling CAN1 filters
      -- corrected receive overrun signaling
      - USART: reflect changes from RTE_Device.h (Ver 2.4.1) adding pin configurations
      - MCI: reflect changes from RTE_Device.h (Ver 2.4.1) adding pin configurations
      - I2C: corrected rise time setting when using ARM_I2C_BUS_SPEED_FAST
      - USB Device:
      -- VBUS detection is selected automatically based on VBUS sensing pin setting (in RTE_Device.h or by STM32CubeMX)
      -- Corrected initial resume signaling after USB Bus Reset
      -- Corrected device status information
    </release>
    <release version="2.8.0" date="2016-04-14">
      Updated CMSIS drivers:
      - EMAC: 
      -- Corrected Ethernet PTP functionality
      - CAN:
      -- Corrected functionality when only one CAN controller is used
      -- Corrected functionality when NULL pointer is provided for one or both signal callbacks in Initialize function call
      - USB Host full-speed:
      -- Removed interrupt priority handling
      - USB Host high-speed:
      -- Added DMA configuration to RTE_Device.h
      -- Corrected wrong result of PipeTransferGetResult for In Pipe transfers in DMA mode
      -- Added check to PipeTransfer function for 4-byte data alignment if DMA is used
      -- Removed interrupt priority handling
      - USART:
      -- Corrected CTS handling and added signal CTS change event.
      Updated examples:
      - Updated emWin examples to emWin V5.32
      - Updated CAN example
      - Updated USB Host examples
      - Updated USB Device CDC ACM VirtualCOM example for Keil MCBSTM32F400 evaluation board
    </release>
    <release version="2.7.0" date="2015-12-08">
      Updated STMicroelectronics STM32CubeF4 Firmware Package to Version 1.10.0.
      - updated affected examples
      MDK-ARM configuration via STM32CubeMX:
      - updated MX_Device.h generation: pin names characters '/', '-', ' ' converted to '_'
      Added examples using Network DualStack (IPv4/IPv6) Middleware targeting MCBSTM32F400 (Keil.MDK-Middleware.7.0.0.pack required)
      Updated all CMSIS drivers:
      - Corrected PowerControl function for Unconditional Power Off
      Updated USB Device CMSIS drivers:
      - Updated handling of Isochronous transfer
      - Updated IN Endpoint FIFO flush procedure
      Updated USB Host CMSIS drivers:
      - Corrected speed setting in high-speed port for On-chip Full-speed PHY
      - Corrected low-speed device on high-speed port functionality
      - Corrected multiple packet sending and PING functionality
      - Added DMA for high-speed port driver to reduce CPU usage for USB (enabled by default)
      - Renamed defines for overriding the maximum number of pipes used
      from USBH_MAX_PIPE_NUM to USBH0_MAX_PIPE_NUM in full-speed driver, and
      from USBH_MAX_PIPE_NUM to USBH1_MAX_PIPE_NUM for high-speed driver
      Updated SPI driver:
      - Corrected 8bit/16bit Data register access, regarding the Data frame size
      Updated CAN driver:
      - added possibility to use only CAN1
      Updated EMAC driver:
      - corrected return value of the ReadFrame function
      Updated SVD files for STM32F427 and STM32F429 fixing inconsistencies and missing information
      Added Debug Description to PDSC for trace configuration
    </release>
    <release version="2.6.0" date="2015-09-16">
      Updated STMicroelectronics STM32CubeF4 Firmware Package to Version 1.8.0 adding device support for:
      - STM32F410, STM32F469 and STM32F479 subfamilies
      Introducing MDK-ARM configuration via STM32CubeMX:
      - see documentation for component Device:STM32CubeFramework:STM32CubeMX
      CMSIS driver:
      - added CAN driver and configuration options in RTE_Device.h
      - updated EMAC driver: corrected lockup after long runtime
      - updated MCI driver: optimized Interrupt handler and corrected clock divider bypass handling
      - updated SPI driver: added support for STM32F410xx devices
      - updated USART driver:added support for STM32F410xx devices and corrected driver incorrectly stopped receiving data when calling the USART_Receive function while the receiver is busy
      - update I2C driver: added support for STM32F410xx devices and corrected 3 byte reception and POS bit handling in master mode as well as corrected acknowledge handling in slave mode
      MDK example projects:
      - added examples created using MDK and STM32CubeMX: Blinky and emWin GUI_VNC for Keil MCBSTM32F400
      - added CAN Data and RTR projects for Keil MCBSTM32F400
      - updated FTP_Server example: Heap memory increased
      - updated LCD configuration for STM32F429I-Discovery Kit (performance improvements and corrections for multi-layer)
    </release>
    <release version="2.5.0" date="2015-06-12">
      Updated to STMicroelectronics STM32CubeF4 Firmware Package V1.6.0
      Updated CMSIS drivers:
      - I2C, MCI, EMAC, USB Device, USB Host, SPI, USART: Updated initialization, uninitialization and power procedures
      - MCI: Corrected data timeout handling
      - SPI:
      -- Corrected status bit-field handling, to prevent race conditions
      -- Corrected ARM_SPI_EVENT_DATA_LOST event generation in master mode at high bus speeds
      -- Corrected bus speed configuration
      - USART:
      -- Corrected status bit-field handling, to prevent race conditions
      -- Added RX TimeOut handling
      - USB Device: Corrected transferred size during transfer
      - USB Host: 
      -- Added pipe bus error signaling of active pipes on port disconnect
      -- Corrected handling on error transfers
      Updated MDK examples:
      - Boards/Keil/MCBSTM32F400/Blinky
      - USB Device Mass Storage Example
    </release>
    <release version="2.4.0" date="2015-03-20">
      Required PACKs: ARM.CMSIS.4.3.0.pack, Keil.MDK-Middleware.6.3.0.pack, Keil.ARM_Compiler.1.0.0.pack
      Updated devices:
      - added STM32F446 Series
      - removed STM32F411CCUx as it does not exist
      Updated drivers:
      - USB Host: Corrected signalling of STALL handshake
      - USB Device:
      -- Corrected IN ZLP sending
      -- VBUS sensing disabled if ARM_USBD_VBUS_DETECT is not enabled
      - USART: corrected when configured via STM32CubeMX
      - I2C:
      -- includes corrected when configured with STM32CubeMX
      -- corrected slave mode and 10-bit addressing mode, I2C2 SDA pin configuration, Enable_GPIO_Clock() function
      - MCI:
      -- includes corrected when configured with STM32CubeMX
      -- correction required due to device errata
      -- added support for SD high speed bus mode
      - SPI: corrected spi->info->mode handling
      Updated examples:
      - Compiler I/O software component is now used for I/O retargeting
      - Updated Network examples for MCBSTM32F400 V1.2 board with KSZ8081RNA Ethernet PHY
      Updated dependencies: 
      - Ethernet does not require CMSIS:RTOS
    </release>
    <release version="2.3.0" date="2014-12-11">
      - USB Host:
      -- corrected interrupt pipe behaviour, and PING on high-speed driver, init/deinit and power control
      -- added VBUS Power pin active high/low functionality, overcurrent state functionality (without event) added
      - USB Device: prevent simultaneous IN writes to FIFO
      - USART and SPI: corrected DMA transfer abort
      - MCI: corrected setting of bus width
      - EMAC: implemented function 'GetMacAddress'
      - EMAC, I2C, MCI, USART, SPI and USBD: corrected some basic MISRA 2004 compliances like signedness, boolean operation on logical operators
      Updated RTE_Device.h: added Receive and transmit DMA configuration for SDIO peripheral
      Renamed SDIO component in 'Device::STM32Cube HAL' to 'SD' to match HAL component name
      Updated examples:
      - File_Demo and USB Host MassStorage examples updated due to the new fdelete() API in File System Version 6.2
      - MCBSTM32F400 USB Host Keyboard example (removed USB High-speed usage)
      - STM32F429I-Discovery Board USB Host examples config files and removed USB High-speed usage from Keyboard example
    </release>
    <release version="2.2.0" date="2014-10-16">
      PACK based on STMicroelectronics STM32CubeF4 Firmware Package V1.3.0
      - STD Peripheral Library components removed
      New Device variants introduced matching ST Cube device database
      - e.g. STM32F407IG -> STM32F407IGHx or STM32F407IGTx
      CMSIS Drivers Version 2 (changed Cclass "Drivers" to "CMSIS Driver")
      - Ethernet MAC, USART, I2C, MCI, SPI, USB Device, USB Host
      MDK-ARM Example projects require MDK-Middleware 6.1.1 and CMSIS 4.2.0
      - Board Support uses Board Interface API from MDK-Middleware (header file names changed)
      - Boards: Keil MCBSTM32F400, ST Microelectronics STM32F429I-Discovery, STM32F401C-Discovery, STM32F4-Discovery
      Difference to version 2.1.0:
      - File stm32f4xx_hal_conf.h moved from component Device::STM32Cube HAL:Common into Device::STM32Cube Framework::Classic
      - Updated RTE_Device and USB Device/Host, USART, MCI and SPI drivers
      - Updated LCD board interface driver for STM32F429-I Discovery
      - Updated ADC board interface driver for MCBSTM32F400
    </release>
    <release version="2.1.0" date="2014-09-29">
      PACK Based on STMicroelectronics STM32CubeF4 Firmware Package V1.3.0
      - STD Peripheral Library components removed
      CMSIS Driver using API V2 for:
      - Ethernet MAC, I2C, MCI, SPI, USB Device, USB Host
      Board Support for:
      - Keil MCBSTM32F400, ST Microelectronics STM32F429I-Discovery, STM32F401C-Discovery, STM32F4-Discovery
      Device Support for:
      - STM32F411 Series added
      - STM32F4 Series updated
      - Flash Size for STM32F401xD, STM32F401xE corrected
    </release>
    <release version="2.0.0">
      Workshop Release not released publically
    </release>
    <release version="1.0.8" date="2014-05-27">
      Device: Startup files for GCC added, conditions extended to reflect toolchain dependencies
    </release>
    <release version="1.0.7" date="2014-04-29">
      Updated UART driver (Added UART7,UART8)
      Updated GPIO driver (Added UART7/UART8 alternate function)
      Updated I2C driver  (BUG Fix: 2 byte reception)
      Device:StdPeriph Drivers:Framework Version: 1.3.1: added file misc.c
      Device:Startup Version: 1.3.1: RTE_Device.h (Fixed preprocessor condition for ETH_MII_RX_ER Pin, Added UART7/UART8)
    </release>
    <release version="1.0.6">
      Added MCBSTM32F400
      Updated Features
      Updated Flash Option Byte Programming
      Added STM32F401C-Discovery Board Bundle
      USB Device drivers update: multiple packet read, EP0 unconfiguration
      Updated SPI driver (IRQ handling corrected)
      Added STM Peripheral Library V1.3.0
    </release>
    <release version="1.0.5">
      Added STM32F401 devices
    </release>
    <release version="1.0.4">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.3">
      Added MCBSTM32F400 Board Support Bundle
      Added STM32F4-Discovery Board Bundle
    </release>
    <release version="1.0.2">
      Added emWin Example and GUIDemo for MCBSTM32F400
      Added emWin LCD driver for MCBSTM32F400
      Updated USBH Drivers (improved robustness)
    </release>
    <release version="1.0.1">
      Generic Drivers moved to "Drivers" Class
      Added UART and I2C Driver
      Updated USBD and USBH Drivers
      Added MCBSTM32F400 Demo example
      Added MCBSTM32F400 USB Host Keyboard example
      Added MCBSTM32F400 BSP Drivers: Joystick, Touchscreen, Accelerometer, Gyroscope, Camera
      Updated MCBSTM32F400 BSP Driver: Keyboard
      Updated STM32F4-Discovery BSP Driver: Keyboard
      Updated all MCBSTM32F400 examples
      Updated all STM32F4-Discovery examples
      Minor corrections:
      - SPI Driver
      - DMA Driver
      - MCI Driver
    </release>
    <release version="1.0.0">
      Release version of STM32F4 Device Family Pack.
    </release>
    <release version="0.0.1">
      Initial version of STM32F4 Device Family Pack.
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F4</keyword>
    <keyword>STM32F4xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F4 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>      <!-- Debug Access Variables have to be re-defined on subfamily level for configfile, needs to be fixed in uVision -->
      <debugvars>
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
        __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
      </debugvars>

