t21/Walnut_X/Packages/.cache/Keil.STM32F4xx_DFP.2.9.0.pdsc
    <condition id="STM32F401xC">
      <description>STMicroelectronics STM32F401xB/C Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F401?[BC]*"/>
    </condition>
    <condition id="STM32F401xE">
      <description>STMicroelectronics STM32F401xD/E Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F401?[DE]*"/>
    </condition>
    <condition id="STM32F405xx">
      <description>STMicroelectronics STM32F405xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F405*"/>
    </condition>
    <condition id="STM32F407xx">
      <description>STMicroelectronics STM32F407xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F407*"/>
    </condition>
    <condition id="STM32F410xx">
      <description>STMicroelectronics STM32F410xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F410*"/>
    </condition>
    <condition id="STM32F410Cx">
      <description>STMicroelectonics STM32F410Cx Series devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32F410C*"/>
    </condition>
    <condition id="STM32F410Rx">
      <description>STMicroelectonics STM32F410Rx Series devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32F410R*"/>
    </condition>
    <condition id="STM32F410Tx">
      <description>STMicroelectonics STM32F410Tx Series devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32F410T*"/>
    </condition>
    <condition id="STM32F411xE">
      <description>STMicroelectronics STM32F411xC/E Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F411?[CE]*"/>
    </condition>
    <condition id="STM32F412Cx">
      <description>STMicroelectronics STM32F412Cx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F412C*"/>
    </condition>
    <condition id="STM32F412Rx">
      <description>STMicroelectronics STM32F412Rx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F412R*"/>
    </condition>
    <condition id="STM32F412Vx">
      <description>STMicroelectronics STM32F412Vx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F412V*"/>
    </condition>
    <condition id="STM32F412Zx">
      <description>STMicroelectronics STM32F412Zx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F412Z*"/>
    </condition>
    <condition id="STM32F412xx">
      <description>STMicroelectronics STM32F412xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F412*"/>
    </condition>
    <condition id="STM32F415xx">
      <description>STMicroelectronics STM32F415xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F415*"/>
    </condition>
    <condition id="STM32F417xx">
      <description>STMicroelectronics STM32F417xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F417*"/>
    </condition>
    <condition id="STM32F427xx">
      <description>STMicroelectronics STM32F427xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F427*"/>
    </condition>
    <condition id="STM32F429xx">
      <description>STMicroelectronics STM32F429xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F429*"/>
    </condition>
    <condition id="STM32F437xx">
      <description>STMicroelectronics STM32F437xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F437*"/>
    </condition>
    <condition id="STM32F439xx">
      <description>STMicroelectronics STM32F439xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F439*"/>
    </condition>
    <condition id="STM32F446xx">
      <description>STMicroelectronics STM32F446xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F446*"/>
    </condition>
    <condition id="STM32F469xx">
      <description>STMicroelectronics STM32F469xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F469*"/>
    </condition>
    <condition id="STM32F479xx">
      <description>STMicroelectronics STM32F479xx Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F479*"/>
    </condition>

    <condition id="STM32F401">
      <description>STMicroelectronics STM32F401 Series devices</description>
      <accept  condition="STM32F401xC"/>
      <accept  condition="STM32F401xE"/>
    </condition>
    <condition id="STM32F40_41x">
      <description>STMicroelectronics STM32F405/407/415/417 Series devices</description>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
    </condition>
    <condition id="STM32F40_41_42_43x">
      <description>STMicroelectronics STM32F405/407/415/417/427/429/437/439 Series devices</description>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
    </condition>
    <condition id="STM32F40_41_42_43_44_46_47x">
      <description>STMicroelectronics STM32F405/407/415/417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F40_41_412_42_43_44_46_47x">
      <description>STMicroelectronics STM32F405/407/412/415/417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F41_43_47x">
      <description>STMicroelectronics STM32F405/415/437/439/479 Series devices</description>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F42_43x">
      <description>STMicroelectronics STM32F427/429/437/439 Series devices</description>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
    </condition>
