t21/Walnut_X/Packages/.cache/Keil.STM32F4xx_DFP.2.9.0.pdsc
    <condition id="STM32F410_40_41_412_42_43_44_46_47x">
      <description>STMicroelectronics STM32F410/405/407/412/415/417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>

    <condition id="STM32F4_ARMCC">
      <description>filter for STM32F4 devices and the ARM compiler</description>
      <require condition="STM32F4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F401_ARMCC">
      <description>filter for STM32F401 devices and the ARM compiler</description>
      <require condition="STM32F401"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F40_41x_ARMCC">
      <description>filter for STM32F405/407/415/417 devices and the ARM compiler</description>
      <require condition="STM32F40_41x"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F42_43x_ARMCC">
      <description>filter for STM32F427/429/437/439 devices and the ARM compiler</description>
      <require condition="STM32F42_43x"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F401xC_ARMCC">
      <description>filter for STM32F401xB/C devices and the ARM compiler</description>
      <require condition="STM32F401xC"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F401xC_GCC">
      <description>filter for STM32F401xB/C devices and the GCC compiler</description>
      <require condition="STM32F401xC"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F401xC_IAR">
      <description>filter for STM32F401xB/C devices and the IAR compiler</description>
      <require condition="STM32F401xC"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F401xE_ARMCC">
      <description>filter for STM32F401xD/E devices and the ARM compiler</description>
      <require condition="STM32F401xE"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F401xE_GCC">
      <description>filter for STM32F401xD/E devices and the GCC compiler</description>
      <require condition="STM32F401xE"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F401xE_IAR">
      <description>filter for STM32F401xD/E devices and the IAR compiler</description>
      <require condition="STM32F401xE"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F410Cx_ARMCC">
      <description>filter for STM32F410Cx devices and the ARM compiler</description>
      <require condition="STM32F410Cx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Cx_GCC">
      <description>filter for STM32F410Cx devices and the GCC compiler</description>
      <require condition="STM32F410Cx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Cx_IAR">
      <description>filter for STM32F410Rx devices and the IAR compiler</description>
      <require condition="STM32F410Cx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F410Rx_ARMCC">
      <description>filter for STM32F410Rx devices and the ARM compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Rx_GCC">
      <description>filter for STM32F410Rx devices and the GCC compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Rx_IAR">
      <description>filter for STM32F410Rx devices and the IAR compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F410Tx_ARMCC">
      <description>filter for STM32F410Tx devices and the ARM compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Tx_GCC">
      <description>filter for STM32F410Tx devices and the GCC compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Tx_IAR">
      <description>filter for STM32F410Tx devices and the IAR compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F411xE_ARMCC">
      <description>filter for STM32F411xC/E devices and the ARM compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F411xE_GCC">
      <description>filter for STM32F411xC/E devices and the GCC compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F411xE_IAR">
      <description>filter for STM32F411xC/E devices and the IAR compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Cx_ARMCC">
      <description>filter for STM32F412Cx devices and the ARM compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Cx_GCC">
      <description>filter for STM32F412Cx devices and the GCC compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="GCC"/>
    </condition>
