t21/Walnut_X/Packages/.cache/Keil.STM32F4xx_DFP.2.9.0.pdsc
    <condition id="STM32F412Cx_IAR">
      <description>filter for STM32F412Cx devices and the IAR compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Rx_ARMCC">
      <description>filter for STM32F412Rx devices and the ARM compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Rx_GCC">
      <description>filter for STM32F412Rx devices and the GCC compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Rx_IAR">
      <description>filter for STM32F412Rx devices and the IAR compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Vx_ARMCC">
      <description>filter for STM32F412Vx devices and the ARM compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Vx_GCC">
      <description>filter for STM32F412Vx devices and the GCC compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Vx_IAR">
      <description>filter for STM32F412Vx devices and the IAR compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Zx_ARMCC">
      <description>filter for STM32F412Zx devices and the ARM compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Zx_GCC">
      <description>filter for STM32F412Zx devices and the GCC compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Zx_IAR">
      <description>filter for STM32F412Zx devices and the IAR compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F405xx_ARMCC">
      <description>filter for STM32F405xx devices and the ARM compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F405xx_GCC">
      <description>filter for STM32F405xx devices and the GCC compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F405xx_IAR">
      <description>filter for STM32F405xx devices and the IAR compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F407xx_ARMCC">
      <description>filter for STM32F407xx devices and the ARM compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F407xx_GCC">
      <description>filter for STM32F407xx devices and the GCC compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F407xx_IAR">
      <description>filter for STM32F407xx devices and the IAR compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F415xx_ARMCC">
      <description>filter for STM32F415xx devices and the ARM compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F415xx_GCC">
      <description>filter for STM32F415xx devices and the GCC compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F415xx_IAR">
      <description>filter for STM32F415xx devices and the IAR compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F417xx_ARMCC">
      <description>filter for STM32F417xx devices and the ARM compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F417xx_GCC">
      <description>filter for STM32F417xx devices and the GCC compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F417xx_IAR">
      <description>filter for STM32F417xx devices and the IAR compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F427xx_ARMCC">
      <description>filter for STM32F427xx devices and the ARM compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F427xx_GCC">
      <description>filter for STM32F427xx devices and the GCC compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F427xx_IAR">
      <description>filter for STM32F427xx devices and the IAR compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F429xx_ARMCC">
      <description>filter for STM32F429xx devices and the ARM compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F429xx_GCC">
      <description>filter for STM32F429xx devices and the GCC compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F429xx_IAR">
      <description>filter for STM32F429xx devices and the IAR compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F437xx_ARMCC">
      <description>filter for STM32F437xx devices and the ARM compiler</description>
      <require condition="STM32F437xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
