t21/Walnut_X/Packages/.cache/Keil.STM32F4xx_DFP.2.9.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CAN" Cversion="1.5.0" condition="STM32F40_41_412_42_43_44_46_47x HAL">
      <description>Controller area network (CAN) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_can.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CEC" Cversion="1.5.0" condition="STM32F446 HAL">
      <description>Consumer Electronics Control (CEC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CEC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_cec.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex" Cversion="1.5.0" condition="STM32F4 HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_cortex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC" Cversion="1.5.0" condition="STM32F4 HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_crc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP" Cversion="1.5.0" condition="STM32F41_43_47x HAL DMA">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_cryp.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_cryp_ex.c" condition="STM32F43_47x"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DAC" Cversion="1.5.0" condition="STM32F410_40_41_42_43_44_46_47x HAL DMA">
      <description>Digital-to-analog converter (DAC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dac.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dac_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI" Cversion="1.5.0" condition="STM32F4x7_9_6 HAL DMA">
      <description>Digital camera interface (DCMI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DCMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dcmi.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dcmi_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA" Cversion="1.5.0" condition="STM32F4 HAL">
      <description>DMA controller (DMA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dma.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dma_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D" Cversion="1.5.0" condition="STM32F42_43_46_47x HAL">
      <description>Chrom-Art Accelerator (DMA2D) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA2D
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dma2d.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DSI" Cversion="1.5.0" condition="STM32F46_47x HAL">
      <description>DSI HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DSI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dsi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ETH" Cversion="1.5.0" condition="STM32F4x7_9 HAL">
      <description>Ethernet MAC (ETH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ETH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_eth.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash" Cversion="1.5.0" condition="STM32F4 HAL">
      <description>Embedded Flash memory HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_flash.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_flash_ex.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_flash_ramfunc.c" condition="STM32F410_411_446"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="FMPI2C" Cversion="1.5.0" condition="STM32F410_412_446 HAL DMA">
      <description>Fast-mode Plus Inter-integrated circuit (FMPI2C) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FMPI2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_fmpi2c.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_fmpi2c_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO" Cversion="1.5.0" condition="STM32F4 HAL">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_gpio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HASH" Cversion="1.5.0" condition="STM32F41_43_47x HAL DMA">
      <description>Hash processor (HASH) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_hash.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_hash_ex.c" condition="STM32F43_47x"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HCD" Cversion="1.5.0" condition="STM32F4x1_40_41_412_42_43_44_46_47x HAL">
      <description>USB Host controller (HCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_hcd.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_usb.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C" Cversion="1.5.0" condition="STM32F4 HAL DMA RCC">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_i2c_ex.c" condition="STM32F4x1_42_43_44_46_47x"/>
      </files>
    </component>

