t21/Walnut_X/Packages/.cache/Keil.STM32F4xx_DFP.2.9.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RTC" Cversion="1.5.0" condition="STM32F4 HAL">
      <description>Real-time clock (RTC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RTC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_rtc.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_rtc_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI" Cversion="1.5.0" condition="STM32F42_43_44_46_47x HAL DMA">
      <description>Serial audio interface (SAI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SAI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_sai.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_sai_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD" Cversion="1.5.0" condition="STM32F4x1_40_41_412_42_43_44_46_47x HAL DMA">
      <description>Secure digital (SD) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_sd.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_sdmmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SDRAM" Cversion="1.5.0" condition="STM32F42_43_44_46_47x HAL DMA">
      <description>SDRAM controller (SDRAM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SDRAM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_sdram.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_fmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Smartcard" Cversion="1.5.0" condition="STM32F4 HAL DMA RCC">
      <description>Smartcard HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SMARTCARD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_smartcard.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPDIFRX" Cversion="1.5.0" condition="STM32F446 HAL DMA">
      <description>SPDIF Receiver interface (SPDIFRX) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SPDIFRX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_spdifrx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SPI" Cversion="1.5.0" condition="STM32F4 HAL DMA">
      <description>Serial peripheral interface (SPI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_spi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM" Cversion="1.5.0" condition="STM32F40_41_412_42_43_44_46_47x HAL DMA">
      <description>SRAM controller (SRAM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_SRAM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_sram.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_fsmc.c" condition="STM32F40_41x"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_ll_fmc.c"  condition="STM32F42_43_44_46_47x"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM" Cversion="1.5.0" condition="STM32F4 HAL DMA">
      <description>Timers (TIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_TIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_tim.c"/>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_tim_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART" Cversion="1.5.0" condition="STM32F4 HAL DMA">
      <description>Universal asynchronous receiver transmitter (UART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_UART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_uart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART" Cversion="1.5.0" condition="STM32F4 HAL DMA RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_usart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="WWDG" Cversion="1.5.0" condition="STM32F4 HAL">
      <description>Window watchdog (WWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_WWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_wwdg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DFSDM" Cversion="1.5.0" condition="STM32F412 HAL">
      <description>Digital Filter for Sigma-Delta Modulators (DFSDM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DFSDM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F4xx_HAL_Driver/Src/stm32f4xx_hal_dfsdm.c"/>
      </files>
    </component>

